from enum import Enum


class TextEnum:
    START_BOT = 'Для роботи з ботом натисніть /start'

    PLEASE_REGISTER_BOT = """Для користування cервісом, спочатку підпишіться на наш офіційний канал - https://t.me/+EbXZHBfHXbszY2I6 
Разом до перемоги 🇺🇦"""

    MSG_LATER = 'Наші адміністратори ретельно перевіряють кожне посилання,' \
                ' щоб вороги не додали українські ресурси на блокування.\n\n' \
                'Спробуйте через 5 хв, ' \
                'Вам буде запропоновано новий перелік ресурсів для надання скарг.'
    ABOUT_US = 'Цей телеграм-бот призначений для блокування ресурсів,' \
               ' що містять небезпечний контент,' \
               ' що сприяє розповсюдженню токсичних ідей та негативного впливу на молодь.' \
               ' Завдяки цьому боту системи МВС України, громадськість може блокувати ресурси та контент,' \
               ' пов\'язаний із молодіжними течіями, що вчиняють правопорушення.'

    INSTRUCTION = '📬 У розділі <b>«Додати ресурс на блокування»</b> - можливо додати посилання для блокування.\n' \
                  '— 🧐Адміністратори його перевірять на відповідність антиукраїнським поглядам,' \
                  ' після чого він буде доступний для надання скарг.\n' \
                  '\n' \
                  '📭 У розділі <b>«Надіслати скаргу на ресурс»</b> - можете долучитися до блокування ресурсів окупанта.\n' \
                  '— 🔗 Вам буде надано випадкове посилання, а також текст скарги, які постійно змінюються. ' \
                  'Не будь-те байдужими – кожна скарга наближає нас до перемоги!\n' \
                  '\n' \
                  '📢 Кнопка <b>«Поділитися»</b> - генерує посилання, яке Ви можете надіслати своїм друзям,' \
                  ' близьким, щоб вони також приєдналися до спільноти «МРІЯ»' \
                  ' та допомагали у наданні скарг на ворожі ресурси.\n' \
                  '\n' \
                  '📊 <b>«Статистика»</b> - розділ для відстеження активності спільноти,' \
                  ' а також власної активності щодо надання скарг на ворожі ресурси.\n' \
                  '\n' \
                  'ℹ <b>«Про нас»</b> - інформація про команду та цілі нашої роботи.'

    SHARE = '📩Ви можете підтримати Україну та розповсюджувати бота за цим посиланням: https://t.me/stopdrugsbot?start='

    CHOSE_RES = 'Якщо перелічені варіанти соціальних мереж Вам не підійшли,' \
                ' можете надіслати посилання на інші ресурси, веб-сайти чи джерела,' \
                ' що поширюють правопорушення молодіжних течій"після кнопки поширити номер бот лежить'

    CALLBACK = 'Для отримання допомоги Ви можете поширити свій контакт,' \
               ' щоб наша служба підтримки могла з Вами зв\'язатися у найкоротший термін 📞'

    LINK_TELEGRAM = 'Введіть посилання на конкретний канал ' \
                    '(групу) чи користувача, якого потрібно ' \
                    'заблокувати. Посилання у форматі: \n' \
                    'https://t.me/..?,\n' \
                    't.me/..? '

    LINK_TELEGRAM_DRUGS = 'Введіть посилання на конкретний канал ' \
                          '(групу) чи користувача, якого потрібно ' \
                          'заблокувати. Посилання у форматі: \n' \
                          'https://t.me/..?,\n' \
                          't.me/..? '

    LINK_TELEGRAM_BOT = 'Введіть посилання на конкретний  Фейковий телеграм  Бот' \
                        'Посилання у форматі: \n' \
                        'https://t.me/..?,\n' \
                        't.me/..?, \n' \
                        '@..?'

    LINK_FACEBOOK = 'Введіть посилання на конкретний канал (групу)' \
                    ' чи користувача, якого потрібно заблокувати.' \
                    ' Посилання у форматі:\n' \
                    'https://www.facebook.com/..?'

    LINK_YOUTUBE = 'Введіть посилання на конкретний канал чи відео,' \
                   ' які потрібно заблокувати.' \
                   ' Посилання у форматі:\n' \
                   'https://www.youtube.com/..?'

    LINK_TWITTER = 'Введіть посилання на конкретного користувача,' \
                   ' якого потрібно заблокувати.' \
                   ' Посилання у форматі:\n' \
                   'https://twitter.com/..?'

    LINK_TIKTOK = 'Введіть посилання на конкретного користувача,' \
                  ' якого потрібно заблокувати.' \
                  ' Посилання у форматі:\n' \
                  'https://www.tiktok.com/..?,\n' \
                  'https://vm.tiktok.com/..?,\n' \
                  'https://tiktok.com/..?'

    LINK_INSTAGRAM = 'Введіть посилання на конкретного користувача,' \
                     ' якого потрібно заблокувати.' \
                     ' Посилання у форматі:\n' \
                     'https://www.instagram.com/..?'

    LINK_ANOTHER = 'Якщо перелічені варіанти соціальних мереж' \
                   ' Вам не підійшли,' \
                   ' можете надіслати посилання на інші ресурси' \
                   ', веб-сайти чи джерела,' \
                   ' що поширюють російську пропаганду.\n' \
                   'Посилання у форматі:\n' \
                   'https://..?,\n' \
                   'http://..? '

    TO_HOMEPAGE = '🔚Повернення на головну сторінку'

    LINK_DESCRIPTION = '📋Напишіть детальніше,' \
                       ' яку саме протиправну діяльність здійснює ресурс.' \
                       ' Це допоможе у його блокуванні. '

    WRONG_FORMAT = '❌Невірний формат посилання'

    LINK_EXISTS = '⛔Такий вже лінк існує в базі⛔'

    SKIPPED = '👌Пропущено\n👍Дякуємо за співпрацю'

    ADDED = '🆗Ресурс додано на блокування.\n👍Дякуємо за Вашу небайдужість!'

    TASK_TEXT = '<u><b>Завдання:</b></u> Виділити пост та додайте скаргу за "Особиста інформація" і додайте текст скарги 👇\n\n' \
                '🌧 <u><b>Текст скарги:</b></u> \n' \
                '<code>{description}</code>\n\n' \
                '🔗<u><b>Посилання:</b></u> {link}\n'

    USER_STATISTIC = "👤 <b>Особиста статистика</b>\n" \
                     "├ <b>Додали</b> посилань на блокування: {count_of_created_links}\n" \
                     "├ <b>Пропустили</b> завдань: {links_skip}\n" \
                     "├ <b>Виконали</b> завдань:  {links_send_to_block}\n" \
                     "┊\n" \
                     "├ ⭐ <b>Ваше звання</b>: {blocker_user_rang}\n" \
                     "└ 🤝 <b>Запросили друзів</b>: {count_of_invited_users} Ви {inviter_user_rang}"

    GLOBAL_STATISTIC = "🛡⚔ <b>Загальна статистика</b>\n" \
                       "├ <b>Всього в базі</b> посилань: {count_of_links}\n" \
                       "├ Кі-ть. <b>користувачів</b>: {user_count}\n" \
                       "┊\n" \
                       "└ ❌ <b>Всього заблоковано</b>: {count_of_blocked_link}"

    START = '🇺🇦 <b>Добрий день</b> {first_name}\n\n' \
            'Вітаємо у спільноті небайдужих українців,' \
            ' які готові протидіяти правопорушенням молодіжних течій у мережі Інтернет \n' \
            '\n' \
            'Ми постійно працюємо для наповнення цього боту (@cyber_varta_bot),' \
            ' де Ви можете додати ресурс із правопорушеннями молодіжних субкультур для блокування,' \
            ' а також надіслати скаргу на такі ресурси, чи на осіб\n' \
            '\n' \
            '❗️До бою! Перемога залежить від кожного з нас!' \


    MORE_START = 'Офіційний чат-бот 🇺🇦,' \
                 ' який приймає інформацію про ресурси,' \
                 ' що поширюють фейки та російську пропаганду.' \
                 ' Підпишись на офіційний канал,' \
                 ' де актуальна та перевірена інформація,' \
                 ' а також важливі завдання для блокування!' \
                 ' Більше учасників - більше скарг!Долучайтесь❗️' \
                 'https://t.me/stoprussiachannel'
